tap "1password/tap"
tap "cloudflare/cloudflare"
tap "daipeihust/tap"
tap "homebrew/bundle"
tap "jandedobbeleer/oh-my-posh"
brew "actionlint"
brew "zstd"
brew "grpc"
brew "thrift"
brew "apache-arrow"
brew "python@3.11"
brew "awscli"
brew "bash-completion@2"
brew "bat"
brew "caddy"
brew "claude-squad"
brew "cloudflared", link: false
brew "cmake"
brew "ruby"
brew "curl"
brew "doctl"
brew "gcc"
brew "openblas"
brew "numpy"
brew "fd"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "libssh"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghq"
brew "git-lfs"
brew "python@3.13"
brew "gobject-introspection"
brew "graphviz"
brew "guile"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "libomp"
brew "lsd"
brew "opam"
brew "openjdk"
brew "osv-scanner"
brew "pipx"
brew "pyenv"
brew "qemu"
brew "ripgrep"
brew "sox"
brew "tippecanoe"
brew "tmux"
brew "tree"
brew "volta"
brew "watch"
brew "zlib"
brew "daipeihust/tap/im-select"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "1password-cli"
cask "alfred"
cask "chromium"
cask "clipy"
cask "codex"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "hiddenbar"
cask "microsoft-remote-desktop"
cask "popclip"
cask "rectangle"
cask "slack"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "geddski.macros"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "humao.rest-client"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "njqdev.vscode-python-typehint"
vscode "pascalsenn.keyboard-quickfix"
vscode "pkief.material-icon-theme"
vscode "qezhu.gitlink"
vscode "redhat.vscode-yaml"
vscode "remisa.shellman"
vscode "ryu1kn.partial-diff"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
vscode "timonwong.shellcheck"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "vincaslt.highlight-matching-tag"
vscode "vscodevim.vim"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
