tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "bat"
brew "dvc"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "git-lfs"
brew "lsd"
brew "ripgrep"
brew "volta"

# For personal PC
tap "1password/tap"
tap "aquasecurity/trivy"
tap "cloudflare/cloudflare"
brew "bash-completion@2"
brew "caddy"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "qemu"
brew "lima"
brew "colima"
brew "harfbuzz"
brew "gobject-introspection"
brew "ffmpeg"
brew "kubernetes-cli"
brew "kubectx"
brew "openjdk"
cask "alfred"
cask "chromium"
cask "clipy"
cask "flutter"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "google-japanese-ime"
cask "hiddenbar"
cask "popclip"
cask "rectangle"
cask "responsively"
cask "slack"
brew "aquasecurity/trivy/trivy"
brew "cloudflare/cloudflare/cloudflared"
cask "1password-cli"